# Напишите программу на Python для вычисления площади трапеции.
h = int(input("height: "))
base1 = int(input("first value: "))
base2 = int(input("second value: "))
s = ((base1+base2)/2)*h
print(s)
